name: "CIFAR10_quick"
layer {
  name: "cifar"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  } 
  image_data_param {
   source: "train_list"
   root_folder: "/home/tairuichen/Documents/caffe-w2v/examples/cifar10/cifar10-image/"
   scale: 0.00390625
   batch_size: 128
   new_height: 32
   new_width: 32
   shuffle: true
  }
  transform_param {
    mirror: true
    #crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
}
layer {
  name: "cifar"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  image_data_param {
   source: "test_list"
   root_folder: "/home/tairuichen/Documents/caffe-w2v/examples/cifar10/cifar10-image/"
   scale: 0.00390625
   batch_size: 100
   new_height: 32
   new_width: 32
   shuffle: true
  }
  transform_param {
    mirror: true
    #crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "pool1"
  top: "pool1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3"
  top: "pool3"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool3"
  top: "ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 300
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
# layer {
#   name: "accuracy"
#   type: "Accuracy"
#   bottom: "ip2"
#   bottom: "label"
#   top: "accuracy"
#   include {
#     phase: TEST
#   }
# }
# layer {
#   name: "loss"
#   type: "SoftmaxWithLoss"
#   bottom: "ip2"
#   bottom: "label"
#   top: "loss"
# }

layer {
  name: "loss"
  type: "HingeRankLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
  hinge_rank_loss_param{
    margin: 0.5
    word2vec: "caffe_CIFAR10_word2vec_300.txt"
  }
}

layer {
  name: "accuracy"
  type: "Evaluate"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  evaluate_param{
    word2vec: "caffe_CIFAR10_word2vec_300.txt"
    num_labels: 10
  }
  include {
    phase: TEST
  }
}